rule Windows_Excessive_Password_Changes_on_Server {
  meta:
    author = "Jonathan Heng"
    description = "Detects excessive password changes on a server, including attempts to change a password"
    date = "2025-06-01"
    severity = "MEDIUM"
    priority = "MEDIUM"
    platform = "Windows"
    mitre_attack_tactic = "Persistence"
    mitre_attack_technique = "Account Manipulation"
    version = "1.00"
    
  events:
    $pwchange.metadata.event_type = "USER_CHANGE_PASSWORD"
//    ($pwchange.metadata.product_event_type = "4723" or $pwchange.metadata.product_event_type = "4724") // Alternative detection method 
    $pwchange.metadata.vendor_name = "Microsoft"
    $pwchange.target.hostname  = $targetHost
    $pwchange.target.user.userid = $targetUser

  match:
    $targetUser over 30m

  outcome:
    $risk_score = max(50)
    $users = array_distinct($targetUser)
    $hosts = array_distinct($targetHost)

  condition:
    #pwchange > 4
}
