rule Windows_Policy_Change {
  meta:
    author = "Jonathan Heng"
    description = "Detects system audit, domain and system access control list policy changes"
    date = "2025-06-01"
    severity = "MEDIUM"
    priority = "MEDIUM"
    platform = "Windows"
    mitre_attack_tactic = "Defence Evasion"
    mitre_attack_technique = "Subvert Trust Control"
    version = "1.00"
    
  events:
    ($event.metadata.product_event_type = "4719" or $event.metadata.product_event_type = "4739" or $event.metadata.product_event_type = "4715")
    $event.metadata.vendor_name = "Microsoft"
    $event.target.user.userid = $targetUser
    $event.target.hostname = $targetHost

  outcome:
    $user = array_distinct($targetUser)
    $host = array_distinct($targetHost)

  condition:
    $event
}
