rule FlowCloud_Registry_Markers {
  meta:
    author = "NVISO"
    description = "Detects FlowCloud malware registry markers from threat group TA410.The malware stores its configuration in the registry alongside drivers utilized by the malware's keylogger components."
    reference = "https://www.proofpoint.com/us/blog/threat-insight/ta410-group-behind-lookback-attacks-against-us-utilities-sector-returns-new"
    sigma_id = "5118765f-6657-4ddb-a487-d7bd673abbf1"
    severity = "CRITICAL"
    priotiry = "CRITICAL"
    platform = "Windows"
    mitre_attack_tactic = "Persistence"
    mitre_attack_technique = "Modify Registry"
    version = "1.00" 

  events:
    $event.metadata.event_type = "REGISTRY_UNCATEGORIZED"
    $event.target.registry.registry_key = /\\HARDWARE\\\{2DB80286-1784-48b5-A751-B6ED1F490303\}|\\HARDWARE\\\{804423C2-F490-4ac3-BFA5-13DEDE63A71A\}|\\HARDWARE\\\{A5124AF5-DF23-49bf-B0ED-A18ED3DEA027\}|\\SYSTEM\\Setup\\PrintResponsor\\/ nocase
    
  condition:
    $event
}
