rule Hacktool_Inveigh_Execution_Artefacts {
  meta:
    author = "Nasreddine Bencherchali (Nextron Systems)"
    description = "Detects the presence and execution of Inveigh via dropped artefacts"
    reference = "https://github.com/Kevin-Robertson/Inveigh/blob/29d9e3c3a625b3033cdaf4683efaafadcecb9007/Inveigh/Support/Output.cs, https://github.com/Kevin-Robertson/Inveigh/blob/29d9e3c3a625b3033cdaf4683efaafadcecb9007/Inveigh/Support/Control.cs, https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/"
    sigma_id = "bb09dd3e-2b78-4819-8e35-a7c1b874e449"
    severity = "CRITICAL"
    priority = "CRITICAL"
    platform = "Windows"
    mitre_attack_tactics = "Command and Control"
    mitre_attack_techniques = "Remote Access Tools: Remote Desktop Software"
    version = "1.00" 

  events:
    $event.metadata.event_type = "FILE_UNCATEGORIZED"
    $event.target.file.names = /\\Inveigh-Log\.txt|\\Inveigh-Cleartext\.txt|\\Inveigh-NTLMv1Users\.txt|\\Inveigh-NTLMv2Users\.txt|\\Inveigh-NTLMv1\.txt|\\Inveigh-NTLMv2\.txt|\\Inveigh-FormInput\.txt|\\Inveigh\.dll|\\Inveigh\.exe|\\Inveigh\.ps1|\\Inveigh-Relay\.ps1/ nocase
    
  condition: 
    $event
}
