rule OceanLotus_Registry_Activity {
  meta:
    author = "megan201296, Jonhnathan Ribeiro"
    description = "Detects registry keys created in OceanLotus (also known as APT32) attacks"
    reference = "https://www.welivesecurity.com/2019/03/20/fake-or-fake-keeping-up-with-oceanlotus-decoys/, https://github.com/eset/malware-ioc/tree/master/oceanlotus"
    sigma_id = "4ac5fc44-a601-4c06-955b-309df8c4e9d4"
    severity = "CRITICAL"
    priority = "CRITICAL"
    platform = "Windows"
    mitre_attack_tactic = "Defense Evasion"
    mitre_attack_technique = "Modify Registry"
    version = "1.00" 

  events:
    $event.metadata.event_type = "REGISTRY_UNCATEGORIZED"
    (
        $event.target.registry.registry_key = /\\SOFTWARE\\Classes\\CLSID\\\{E08A0F4B-1F65-4D4D-9A09-BD4625B9C5A1\}\\Model/ nocase or
        $event.target.registry.registry_key = /Classes\\AppXc52346ec40fb4061ad96be0e6cb7d16a\\|Classes\\AppX3bbba44c6cae4d9695755183472171e2\\|Classes\\CLSID\\\{E3517E26-8E93-458D-A6DF-8030BC80528B\}\\|Classes\\CLSID\\\{E08A0F4B-1F65-4D4D-9A09-BD4625B9C5A1\}\\Model/ nocase or 
        (
            $event.target.registry.registry_key = /\\SOFTWARE\\App\\/ nocase and 
            $event.target.registry.registry_key = /AppXbf13d4ea2945444d8b13e2121cb6b663\\|AppX70162486c7554f7f80f481985d67586d\\|AppX37cc7fdccd644b4f85f4b22d5a3f105a\\/ nocase and
            $event.target.registry.registry_key = /Application|DefaultIcon/ nocase
        )
    )
    
  condition: 
    $event
}
