rule PrinterNightmare_Mimikatz_Driver_Name {
  meta:
    author = "Markus Neis, @markus_neis, Florian Roth"
    description = "Detects static QMS 810 and mimikatz driver name used by Mimikatz as exploited in CVE-2021-1675 and CVE-2021-34527"
    reference = "https://github.com/gentilkiwi/mimikatz/commit/c21276072b3f2a47a21e215a46962a17d54b3760, https://www.lexjansen.com/sesug/1993/SESUG93035.pdf, https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-rprn/4464eaf0-f34f-40d5-b970-736437a21913, https://nvd.nist.gov/vuln/detail/cve-2021-1675, https://nvd.nist.gov/vuln/detail/cve-2021-34527"
    sigma_id = "ba6b9e43-1d45-4d3c-a504-1043a64c8469"
    severity = "CRITICAL"
    priority = "CRITICAL"
    platform = "Windows"
    mitre_attack_tactic = "Execution"
    mitre_attack_technique = "User Execution"
    version = "1.00" 

  events:
    $event.metadata.event_type = "REGISTRY_UNCATEGORIZED"
    (
        $event.target.registry.registry_key = /\\Control\\Print\\Environments\\Windows x64\\Drivers\\Version-3\\QMS 810\\|\\Control\\Print\\Environments\\Windows x64\\Drivers\\Version-3\\mimikatz/ nocase or
        (
            $event.target.registry.registry_key = /legitprinter/ nocase and
            $event.target.registry.registry_key = /\\Control\\Print\\Environments\\Windows/ nocase
        )
        or
        (
            $event.target.registry.registry_key = /\\Control\\Print\\Environments|\\CurrentVersion\\Print\\Printers/ nocase and 
            $event.target.registry.registry_key = /Gentil Kiwi|mimikatz printer|Kiwi Legit Printer/ nocase
        )
    )
    
  condition: 
    $event
}
